class Weather:
    """
    Parametrs:
    :wind_speed: - кортеж вероятностей скоростей ветра (для скоростей 1,2,3, 4 м/с и максимальная)
    :temperature: - кортеж вероятностей температур  (для температур <10,10-20,20-30 и максимальная)
    :cloud_cover: - вероятность облачности (0%, 60-90%, 100%)
    :wind direction: - вероятность направлений ветра Север, С - В, Восток, Ю - В, Юг,Ю - З, Запад, С - З
    """
    wind_speed = (0.04, 0.22, 0.32, 0.42, 0.000274809)
    temperature = (0.59, 0.36, 0.05, 0.000580153)
    cloud_cover = (0.53, 0.25, 0.22)
    wind_direction = (0.06, 0.01, 0.26, 0.2, 0.1, 0.03, 0.32, 0.02)


# Север, С - В, Восток, Ю - В, Юг,Ю - З, Запад, С - З

